codeStreamINIT/ellipticalIC/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (phase1 phase2);

phase1
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 1e-7;
    rho             rho [ 1 -3 0 0 0 0 0 ] 1000;
}

phase2
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 1e-7;
    rho             rho [ 1 -3 0 0 0 0 0 ] 10;
}

//sigma           sigma [ 1 0 -2 0 0 0 0 ] 0.1;
sigma           sigma [ 1 0 -2 0 0 0 0 ] 1000;

// ************************************************************************* //
