codeStreamINIT/ellipticalIC/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.phase1 0
);

regions
(

    surfaceToCell
    {
	file "./geo/ellipse.stl";

	//definition of outside
	outsidePoints ((0.5 0.85 0));

	//cells cut by surface
	includeCut false;

	//cells outside surf
	includeOutside false;

	//cells inside surf
	includeInside true;

	//cells with centre near surf 
	//set to -1 to disable
	nearDistance -1;

	//cells within nearDistance and near surf curvature
	//set to -100 to diable
	curvature -100;

        fieldValues
        (
            volScalarFieldValue alpha.phase1 1
        );

    }

);

// ************************************************************************* //
